Revit 2027 API
ExporterIFCUtils.AddClippingsToBaseExtrusion Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCAnyHandle AddClippingsToBaseExtrusion(
	ExporterIFC exporterIFC,
	Wall wall,
	XYZ setterOffset,
	IFCRange range,
	IFCRange zSpan,
	IFCAnyHandle baseBodyItemHandle,
	out IList<IFCExtrusionData> pCutPairOpenings
)
Public Shared Function AddClippingsToBaseExtrusion (
	exporterIFC As ExporterIFC,
	wall As Wall,
	setterOffset As XYZ,
	range As IFCRange,
	zSpan As IFCRange,
	baseBodyItemHandle As IFCAnyHandle,
	<OutAttribute> ByRef pCutPairOpenings As IList(Of IFCExtrusionData)
) As IFCAnyHandle
public:
static IFCAnyHandle^ AddClippingsToBaseExtrusion(
	ExporterIFC^ exporterIFC,
	Wall^ wall,
	XYZ^ setterOffset,
	IFCRange^ range,
	IFCRange^ zSpan,
	IFCAnyHandle^ baseBodyItemHandle,
	[OutAttribute] IList<IFCExtrusionData^>^% pCutPairOpenings
)
static member AddClippingsToBaseExtrusion :
        exporterIFC : ExporterIFC *
        wall : Wall *
        setterOffset : XYZ *
        range : IFCRange *
        zSpan : IFCRange *
        baseBodyItemHandle : IFCAnyHandle *
        pCutPairOpenings : IList<IFCExtrusionData> byref -> IFCAnyHandle
Parameters
exporterIFC ExporterIFC
wall Wall
setterOffset XYZ
range IFCRange
zSpan IFCRange
baseBodyItemHandle IFCAnyHandle
pCutPairOpenings IList<IFCExtrusionData>
Return Value
IFCAnyHandle
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace